LinIT-L/ESP32-S3-RLCD-BBK/sdkconfig.defaults
# ESP32-S3-RLCD-4.2 步步高模拟器配置
# 芯片: ESP32-S3-WROOM-1-N16R8 (16MB Flash, 8MB PSRAM)

CONFIG_IDF_TARGET="esp32s3"

# Flash
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y

# 分区表 (自定义,容纳大应用)
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# PSRAM (8MB 八线, 80MHz) — gam4980 的 6MB ROM 数据必须放 PSRAM
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
# 允许 BSS 段放 PSRAM (sys 结构体 ~6MB)
CONFIG_SPIRAM_ALLOW_BSS_SEG_EXTERNAL_MEMORY=y
# V1.0.64: 关闭 SPIRAM_RODATA (字库等 rodata 保持 Flash XIP, 不进 PSRAM).
# 之前=y 时开机把全部字库(~4.9MB)复制进 PSRAM, 堆只剩 3.1MB,
# gam4980 需要 6MB PSRAM -> 分配失败 -> 进游戏 5% 时写空指针崩溃重启.
# 现在字库按需从 Flash 缓存读取, PSRAM 堆恢复到 ~7.4MB, BBK 正常.
# CONFIG_SPIRAM_RODATA=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=4096
# 允许 FreeRTOS 任务栈放 PSRAM (音频解码任务栈 60KB, 蓝牙任务栈也需要)
CONFIG_SPIRAM_ALLOW_STACK_EXTERNAL_MEMORY=y

# FAT 文件系统 (SD 卡读 ROM, 支持中文长文件名)
CONFIG_FATFS_LFN_HEAP=y
CONFIG_FATFS_CODEPAGE_936=y
CONFIG_FATFS_CODEPAGE=936
CONFIG_FATFS_API_ENCODING_UTF_8=y

# FreeRTOS
CONFIG_FREERTOS_HZ=1000

# 启用蓝牙 (BLE HID Host)
# 注意: ESP32-S3 只支持 BLE, **不支持经典蓝牙 (BR/EDR)** — 硬件限制!
# 见 soc_caps.h: ESP32-S3 没有 SOC_BT_CLASSIC_SUPPORTED 宏, 只有 SOC_BLE_SUPPORTED
# 因此 BT_CLASSIC_ENABLED / BT_HID_HOST_ENABLED 不可启用 (Kconfig 依赖 SOC_BT_CLASSIC_SUPPORTED)
CONFIG_BT_ENABLED=y
CONFIG_BT_BLUEDROID_ENABLED=y
CONFIG_BT_CLASSIC_ENABLED=n
# 禁用 Classic BT HID Host (因为 Classic BT 已禁用, 否则 esp_hidh_init 会失败)
# 这样 esp_hidh_init 只初始化 BLE HID Host (esp_ble_hidh_init)
CONFIG_BT_HID_HOST_ENABLED=n
CONFIG_BT_BLE_ENABLED=y
CONFIG_BT_GATTC_ENABLE=y
# CONFIG_BT_GATTS_ENABLE is not set
CONFIG_BT_SMP_ENABLED=y
# 启用 BLE 4.2 功能 (包含扫描 API: esp_ble_gap_start_scanning 等)
CONFIG_BT_BLE_42_FEATURES_SUPPORTED=y
# V1.0.67: 省内存 — 活动连接 6->2, Bluedroid 环境内存动态分配(可落 PSRAM)
CONFIG_BT_CTRL_BLE_MAX_ACT=2
CONFIG_BT_BLE_DYNAMIC_ENV_MEMORY=y

# 蓝牙控制器: ESP32-S3 仅支持 BLE, 强制单模 (双模会启用失败)
# CONFIG_BTDM_CTRL_MODE_BLE_ONLY=y (默认值, 不显式设置)

# 蓝牙任务栈: BTC/BTU 在内部 DRAM, 不能太大; bt_init 栈(动态64KB)放PSRAM
CONFIG_BT_BTC_TASK_STACK_SIZE=6144
CONFIG_BT_BTU_TASK_STACK_SIZE=8192
# BT 内存优先从 PSRAM 分配 (解决连接时 "BLE_INIT: Malloc failed")
CONFIG_BT_ALLOCATION_FROM_SPIRAM_FIRST=y
# 只需 2 条 ACL 连接 (1手柄+1耳机), 减少内部 RAM 占用 (默认4条浪费内存)
CONFIG_BT_ACL_CONNECTIONS=2

# 禁用 secure boot (避免依赖 micro-ecc submodule)
CONFIG_SECURE_BOOT=n
CONFIG_SECURE_BOOT_V2_ENABLED=n

# lwip 已从 gitee 镜像克隆, 启用网络栈 (esp_http_server 等组件依赖)
# CONFIG_LWIP_ENABLE 默认为 y (SOC_WIFI_SUPPORTED)

# 关闭 mbedTLS 证书包 (避免依赖 mbedtls submodule 的 esp_crt_bundle)
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=n

# 关闭 mbedTLS 硬件加速 (上游 mbedtls 不含 espressif 的 soft fallback 类型)
CONFIG_MBEDTLS_HARDWARE_AES=n
CONFIG_MBEDTLS_HARDWARE_MPI=n
CONFIG_MBEDTLS_HARDWARE_SHA=n
CONFIG_MBEDTLS_HARDWARE_GCM=n
CONFIG_MBEDTLS_HARDWARE_ECC=n
CONFIG_MBEDTLS_HARDWARE_ECDSA_SIGN=n
CONFIG_MBEDTLS_HARDWARE_ECDSA_VERIFY=n
CONFIG_MBEDTLS_GCM_SUPPORT_NON_AES_CIPHER=n
CONFIG_TINYUSB_MSC_ENABLED=y

# CPU 频率: 240MHz (默认 160MHz, 提升 50% 性能)
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ=240

# 编译器优化: 速度优先 (-O2 替代默认 -Os)
CONFIG_COMPILER_OPTIMIZATION_SPEED=y

# WiFi 联网 (V1.0.46 起启用: STA 连接, 设置中心扫描并输入密码)
CONFIG_ESP_WIFI_ENABLED=y
CONFIG_ESP_COEX_ENABLED=y
# V1.0.67: 蓝牙+音频占用大量 DMA 后, WiFi 16KB 静态 RX 缓冲分不到导致 init 失败,
# 减小缓冲降低 DMA 需求 (网页手柄/天气小数据足够)
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=4
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=16
CONFIG_ESP_WIFI_DYNAMIC_TX_BUFFER_NUM=16
